function HelpLibrary() {
  return (
    <div className=''>
      <h1>Библиотека концептуальных схем</h1>
      <p>В библиотеки собраны различные концептуальные схемы. Группировка и классификации схем на данный момент не проводится.</p>
      <p>На текущем этапе развития Портала происходит первичное наполнение Библиотеки концептуальными схемами.</p>
      <p>Доступен поиск схемы в Библиотеке с помощью инструментов, расположенных в верхней части страницы.</p>
      <p>Аттрибут "общедоступная схема" делает схему видимой в разделе библиотека.</p>
      <p>Аттрибут "библиотечная схема" позволяет выделить неизменяемые схемы, используемые как примеры и основа последующих разработок.</p>
    </div>
  );
}

export default HelpLibrary;
