function HelpRSFormMeta() {
  // prettier-ignore
  return (
  <div>
    <h1>Паспорт схемы</h1>
    <p><b>Сохранить изменения</b>: Ctrl + S или кнопка Сохранить</p>
    <p><b>Владелец</b> обладает правом редактирования</p>
    <p><b>Общедоступные</b> схемы доступы для всех</p>
    <p><b>Неизменные</b> схемы редактируют только администраторы</p>
    <p><b>Клонировать</b> - создать копию схемы под своим именем</p>
    <p><b>Отслеживание</b> - схема в персональном списке</p>
    <p><b>Загрузить/Выгрузить схему</b> - взаимодействие с Экстеор</p>
  </div>);
}

export default HelpRSFormMeta;
