function HelpVersions() {
  // prettier-ignore
  return (
  <div>
    <h1>Версионирование схем</h1>
    <p>Версионирование позволяет сохранить текущее состояние схемы под определенным именем (версией) и использовать ссылку на него для совместной работы. После создания версии ее содержание изменить нельзя</p>
    <p><b>Владелец</b> обладает правом редактирования названий и создания новых версий</p>
    <p>Управление версиями происходит в Карточке схемы</p>
    <p>Функция Поделиться включает текущую выбранную версию в ссылку</p>
  </div>);
}

export default HelpVersions;
