import { useTx } from '@/i18n';

export function HelpRSLangExpressionSetRu() {
  const tx = useTx();
  return (
    <>
      <h1>{tx('tx.rsexpression.set')}</h1>
      <p>
        Теоретико-множественные выражения (ТМВ) в ЯРЭ используются для задания и преобразования
        множеств. Сложные конструкции теоретико-множественных выражений выделены в индивидуальные разделы справочника.
      </p>
      <p>
        В данном разделе приведены классические операции над множествами, построенные на основе предикатов
        принадлежности и логических связок.
      </p>

      <h2>Основные операции</h2>
      <ul>
        <li>
          <b>Объединение</b>: <code>D1 ∪ D2</code> — множество элементов, принадлежащих D1 или D2.
        </li>
        <li>
          <b>Пересечение</b>: <code>D1 ∩ D2</code> — множество элементов, принадлежащих и D1, и D2.
        </li>
        <li>
          <b>Разность</b>: <code>D1 \ D2</code> — множество элементов, принадлежащих D1, но не D2.
        </li>
        <li>
          <b>Симметрическая разность</b>: <code>D1 ∆ D2</code> — множество элементов, принадлежащих исключительно D1 или
          исключительно D2.
        </li>
      </ul>

      <h2>{tx('tx.general.example')}</h2>
      <ul>
        <li>
          <code>{`{1,2} ∪ {2,3} = {1,2,3}`}</code>
        </li>
        <li>
          <code>{`{1,2,3} ∩ {2,3,4} = {2,3}`}</code>
        </li>
        <li>
          <code>{`{1,2,3} \\ {2} = {1,3}`}</code>
        </li>
      </ul>
    </>
  );
}
